In [ ]:
#### Pandas Input Output

In [ ]:
# pickle 파일 읽어오기

In [3]:
import pickle

In [4]:
with open("data.pkl", 'rb') as f:
    result_df = pickle.load(f)

result_df

     Name  Money
0    Alan  18000
1   Alvin  13000
2  Andrew   3000
3   Billy  37000
4     Jin  16000

In [5]:
result_df.to_csv("datas/foo.csv", index=False) #encoding 으로 해서 잘 불러와야 함

In [6]:
%ls datas

article_1200.csv   foo.csv            premierleague.csv  train.csv

In [7]:
load_df = pd.read_csv("datas/foo.csv")

In [8]:
load_df

     Name  Money
0    Alan  18000
1   Alvin  13000
2  Andrew   3000
3   Billy  37000
4     Jin  16000